ARMmbed/mbed-os/targets/TARGET_Infineon/XMCLib/inc/xmc4_gpio_map.h
#if (UC_DEVICE == XMC4104) && (UC_PACKAGE == VQFN48)
#define P0_0	XMC_GPIO_PORT0, 0
#define P0_1	XMC_GPIO_PORT0, 1
#define P0_2	XMC_GPIO_PORT0, 2
#define P0_3	XMC_GPIO_PORT0, 3
#define P0_4	XMC_GPIO_PORT0, 4
#define P0_5	XMC_GPIO_PORT0, 5
#define P0_6	XMC_GPIO_PORT0, 6
#define P0_7	XMC_GPIO_PORT0, 7
#define P0_8	XMC_GPIO_PORT0, 8
#define P0_9	XMC_GPIO_PORT0, 9
#define P1_0	XMC_GPIO_PORT1, 0
#define P1_1	XMC_GPIO_PORT1, 1
#define P1_2	XMC_GPIO_PORT1, 2
#define P1_3	XMC_GPIO_PORT1, 3
#define P1_4	XMC_GPIO_PORT1, 4
#define P1_5	XMC_GPIO_PORT1, 5
#define P2_0	XMC_GPIO_PORT2, 0
#define P2_1	XMC_GPIO_PORT2, 1
#define P2_2	XMC_GPIO_PORT2, 2
#define P2_3	XMC_GPIO_PORT2, 3
#define P2_4	XMC_GPIO_PORT2, 4
#define P2_5	XMC_GPIO_PORT2, 5
#define P14_0	XMC_GPIO_PORT14, 0
#define P14_3	XMC_GPIO_PORT14, 3
#define P14_4	XMC_GPIO_PORT14, 4
#define P14_5	XMC_GPIO_PORT14, 5
#define P14_6	XMC_GPIO_PORT14, 6
#define P14_7	XMC_GPIO_PORT14, 7
#define P14_8	XMC_GPIO_PORT14, 8
#define P14_9	XMC_GPIO_PORT14, 9


/* Alternate Output Function */
#define P0_0_AF_CCU80_OUT21 	XMC_GPIO_MODE_OUTPUT_ALT3
#define P0_0_AF_LEDTS0_COL2 	XMC_GPIO_MODE_OUTPUT_ALT4
#define P0_1_AF_U1C1_DOUT0  	XMC_GPIO_MODE_OUTPUT_ALT2
#define P0_1_AF_CCU80_OUT11 	XMC_GPIO_MODE_OUTPUT_ALT3
#define P0_1_AF_LEDTS0_COL3 	XMC_GPIO_MODE_OUTPUT_ALT4
#define P0_2_AF_U1C1_SELO1  	XMC_GPIO_MODE_OUTPUT_ALT2
#define P0_2_AF_CCU80_OUT01 	XMC_GPIO_MODE_OUTPUT_ALT3
#define P0_2_AF_HRPWM0_OUT01	XMC_GPIO_MODE_OUTPUT_ALT4
#define P0_3_AF_CCU80_OUT20 	XMC_GPIO_MODE_OUTPUT_ALT3
#define P0_3_AF_HRPWM0_OUT20	XMC_GPIO_MODE_OUTPUT_ALT4
#define P0_4_AF_CCU80_OUT10 	XMC_GPIO_MODE_OUTPUT_ALT3
#define P0_4_AF_HRPWM0_OUT21	XMC_GPIO_MODE_OUTPUT_ALT4
#define P0_5_AF_U1C0_DOUT0  	XMC_GPIO_MODE_OUTPUT_ALT2
#define P0_5_AF_CCU80_OUT00 	XMC_GPIO_MODE_OUTPUT_ALT3
#define P0_5_AF_HRPWM0_OUT00	XMC_GPIO_MODE_OUTPUT_ALT4
#define P0_6_AF_U1C0_SELO0  	XMC_GPIO_MODE_OUTPUT_ALT2
#define P0_6_AF_CCU80_OUT30 	XMC_GPIO_MODE_OUTPUT_ALT3
#define P0_6_AF_HRPWM0_OUT30	XMC_GPIO_MODE_OUTPUT_ALT4
#define P0_7_AF_WDT_REQUEST 	XMC_GPIO_MODE_OUTPUT_ALT1
#define P0_7_AF_U0C0_SELO0  	XMC_GPIO_MODE_OUTPUT_ALT2
#define P0_7_AF_HRPWM0_OUT11	XMC_GPIO_MODE_OUTPUT_ALT4
#define P0_8_AF_SCU_EXTCLK  	XMC_GPIO_MODE_OUTPUT_ALT1
#define P0_8_AF_U0C0_SCLKOUT	XMC_GPIO_MODE_OUTPUT_ALT2
#define P0_8_AF_HRPWM0_OUT10	XMC_GPIO_MODE_OUTPUT_ALT4
#define P1_0_AF_U0C0_SELO0  	XMC_GPIO_MODE_OUTPUT_ALT2
#define P1_0_AF_CCU40_OUT3  	XMC_GPIO_MODE_OUTPUT_ALT3
#define P1_0_AF_ERU1_PDOUT3 	XMC_GPIO_MODE_OUTPUT_ALT4
#define P1_1_AF_U0C0_SCLKOUT	XMC_GPIO_MODE_OUTPUT_ALT2
#define P1_1_AF_CCU40_OUT2  	XMC_GPIO_MODE_OUTPUT_ALT3
#define P1_1_AF_ERU1_PDOUT2 	XMC_GPIO_MODE_OUTPUT_ALT4
#define P1_2_AF_CCU40_OUT1  	XMC_GPIO_MODE_OUTPUT_ALT3
#define P1_2_AF_ERU1_PDOUT1 	XMC_GPIO_MODE_OUTPUT_ALT4
#define P1_3_AF_U0C0_MCLKOUT	XMC_GPIO_MODE_OUTPUT_ALT2
#define P1_3_AF_CCU40_OUT0  	XMC_GPIO_MODE_OUTPUT_ALT3
#define P1_3_AF_ERU1_PDOUT0 	XMC_GPIO_MODE_OUTPUT_ALT4
#define P1_4_AF_WDT_REQUEST 	XMC_GPIO_MODE_OUTPUT_ALT1
#define P1_4_AF_CCU80_OUT33 	XMC_GPIO_MODE_OUTPUT_ALT3
#define P1_5_AF_U0C0_DOUT0  	XMC_GPIO_MODE_OUTPUT_ALT2
#define P1_5_AF_CCU80_OUT23 	XMC_GPIO_MODE_OUTPUT_ALT3
#define P2_0_AF_LEDTS0_COL1 	XMC_GPIO_MODE_OUTPUT_ALT4
#define P2_1_AF_LEDTS0_COL0 	XMC_GPIO_MODE_OUTPUT_ALT4
#define P2_2_AF_VADC_EMUX00 	XMC_GPIO_MODE_OUTPUT_ALT1
#define P2_2_AF_CCU41_OUT3  	XMC_GPIO_MODE_OUTPUT_ALT3
#define P2_2_AF_LEDTS0_LINE0	XMC_GPIO_MODE_OUTPUT_ALT4
#define P2_3_AF_VADC_EMUX01 	XMC_GPIO_MODE_OUTPUT_ALT1
#define P2_3_AF_U0C1_SELO0  	XMC_GPIO_MODE_OUTPUT_ALT2
#define P2_3_AF_CCU41_OUT2  	XMC_GPIO_MODE_OUTPUT_ALT3
#define P2_3_AF_LEDTS0_LINE1	XMC_GPIO_MODE_OUTPUT_ALT4
#define P2_4_AF_VADC_EMUX02 	XMC_GPIO_MODE_OUTPUT_ALT1
#define P2_4_AF_U0C1_SCLKOUT	XMC_GPIO_MODE_OUTPUT_ALT2
#define P2_4_AF_CCU41_OUT1  	XMC_GPIO_MODE_OUTPUT_ALT3
#define P2_4_AF_LEDTS0_LINE2	XMC_GPIO_MODE_OUTPUT_ALT4
#define P2_5_AF_U0C1_DOUT0  	XMC_GPIO_MODE_OUTPUT_ALT2
#define P2_5_AF_CCU41_OUT0  	XMC_GPIO_MODE_OUTPUT_ALT3
#define P2_5_AF_LEDTS0_LINE3	XMC_GPIO_MODE_OUTPUT_ALT4

/* HW control options */
#define P0_2_HWCTRL_U1C0_DOUT3        	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P0_3_HWCTRL_U1C0_DOUT2        	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P0_4_HWCTRL_U1C0_DOUT1        	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P0_5_HWCTRL_U1C0_DOUT0        	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P1_2_HWCTRL_U0C0_DOUT3        	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P1_3_HWCTRL_U0C0_DOUT2        	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P1_4_HWCTRL_U0C0_DOUT1        	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P1_5_HWCTRL_U0C0_DOUT0        	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P2_1_HWCTRL_DB_TDO_TRACESWO   	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P2_2_HWCTRL_LEDTS0_TSIN0      	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P2_3_HWCTRL_LEDTS0_TSIN1      	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P2_4_HWCTRL_LEDTS0_TSIN2      	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P2_5_HWCTRL_LEDTS0_TSIN3      	XMC_GPIO_HWCTRL_PERIPHERAL1
#endif


#if (UC_DEVICE == XMC4108) && (UC_PACKAGE == LQFP64)
#define P0_0	XMC_GPIO_PORT0, 0
#define P0_1	XMC_GPIO_PORT0, 1
#define P0_2	XMC_GPIO_PORT0, 2
#define P0_3	XMC_GPIO_PORT0, 3
#define P0_4	XMC_GPIO_PORT0, 4
#define P0_5	XMC_GPIO_PORT0, 5
#define P0_6	XMC_GPIO_PORT0, 6
#define P0_7	XMC_GPIO_PORT0, 7
#define P0_8	XMC_GPIO_PORT0, 8
#define P0_9	XMC_GPIO_PORT0, 9
#define P0_10	XMC_GPIO_PORT0, 10
#define P0_11	XMC_GPIO_PORT0, 11
#define P1_0	XMC_GPIO_PORT1, 0
#define P1_1	XMC_GPIO_PORT1, 1
#define P1_2	XMC_GPIO_PORT1, 2
#define P1_3	XMC_GPIO_PORT1, 3
#define P1_4	XMC_GPIO_PORT1, 4
#define P1_5	XMC_GPIO_PORT1, 5
#define P1_7	XMC_GPIO_PORT1, 7
#define P1_8	XMC_GPIO_PORT1, 8
#define P1_9	XMC_GPIO_PORT1, 9
#define P1_15	XMC_GPIO_PORT1, 15
#define P2_0	XMC_GPIO_PORT2, 0
#define P2_1	XMC_GPIO_PORT2, 1
#define P2_2	XMC_GPIO_PORT2, 2
#define P2_3	XMC_GPIO_PORT2, 3
#define P2_4	XMC_GPIO_PORT2, 4
#define P2_5	XMC_GPIO_PORT2, 5
#define P2_6	XMC_GPIO_PORT2, 6
#define P2_7	XMC_GPIO_PORT2, 7
#define P2_8	XMC_GPIO_PORT2, 8
#define P2_9	XMC_GPIO_PORT2, 9
#define P2_14	XMC_GPIO_PORT2, 14
#define P2_15	XMC_GPIO_PORT2, 15
#define P3_0	XMC_GPIO_PORT3, 0
#define P14_0	XMC_GPIO_PORT14, 0
#define P14_3	XMC_GPIO_PORT14, 3
#define P14_4	XMC_GPIO_PORT14, 4
#define P14_5	XMC_GPIO_PORT14, 5
#define P14_6	XMC_GPIO_PORT14, 6
#define P14_7	XMC_GPIO_PORT14, 7
#define P14_8	XMC_GPIO_PORT14, 8
#define P14_9	XMC_GPIO_PORT14, 9
#define P14_14	XMC_GPIO_PORT14, 14


/* Alternate Output Function */
#define P0_0_AF_CAN_N0_TXD  	XMC_GPIO_MODE_OUTPUT_ALT2
#define P0_0_AF_CCU80_OUT21 	XMC_GPIO_MODE_OUTPUT_ALT3
#define P0_1_AF_U1C1_DOUT0  	XMC_GPIO_MODE_OUTPUT_ALT2
#define P0_1_AF_CCU80_OUT11 	XMC_GPIO_MODE_OUTPUT_ALT3
#define P0_2_AF_U1C1_SELO1  	XMC_GPIO_MODE_OUTPUT_ALT2
#define P0_2_AF_CCU80_OUT01 	XMC_GPIO_MODE_OUTPUT_ALT3
#define P0_3_AF_CCU80_OUT20 	XMC_GPIO_MODE_OUTPUT_ALT3
#define P0_4_AF_CCU80_OUT10 	XMC_GPIO_MODE_OUTPUT_ALT3
#define P0_5_AF_U1C0_DOUT0  	XMC_GPIO_MODE_OUTPUT_ALT2
#define P0_5_AF_CCU80_OUT00 	XMC_GPIO_MODE_OUTPUT_ALT3
#define P0_6_AF_U1C0_SELO0  	XMC_GPIO_MODE_OUTPUT_ALT2
#define P0_6_AF_CCU80_OUT30 	XMC_GPIO_MODE_OUTPUT_ALT3
#define P0_7_AF_WDT_REQUEST 	XMC_GPIO_MODE_OUTPUT_ALT1
#define P0_7_AF_U0C0_SELO0  	XMC_GPIO_MODE_OUTPUT_ALT2
#define P0_8_AF_SCU_EXTCLK  	XMC_GPIO_MODE_OUTPUT_ALT1
#define P0_8_AF_U0C0_SCLKOUT	XMC_GPIO_MODE_OUTPUT_ALT2
#define P0_9_AF_U1C1_SELO0  	XMC_GPIO_MODE_OUTPUT_ALT2
#define P0_9_AF_CCU80_OUT12 	XMC_GPIO_MODE_OUTPUT_ALT3
#define P0_10_AF_U1C1_SCLKOUT	XMC_GPIO_MODE_OUTPUT_ALT2
#define P0_10_AF_CCU80_OUT02	XMC_GPIO_MODE_OUTPUT_ALT3
#define P0_11_AF_U1C0_SCLKOUT	XMC_GPIO_MODE_OUTPUT_ALT2
#define P0_11_AF_CCU80_OUT31	XMC_GPIO_MODE_OUTPUT_ALT3
#define P1_0_AF_U0C0_SELO0  	XMC_GPIO_MODE_OUTPUT_ALT2
#define P1_0_AF_CCU40_OUT3  	XMC_GPIO_MODE_OUTPUT_ALT3
#define P1_0_AF_ERU1_PDOUT3 	XMC_GPIO_MODE_OUTPUT_ALT4
#define P1_1_AF_U0C0_SCLKOUT	XMC_GPIO_MODE_OUTPUT_ALT2
#define P1_1_AF_CCU40_OUT2  	XMC_GPIO_MODE_OUTPUT_ALT3
#define P1_1_AF_ERU1_PDOUT2 	XMC_GPIO_MODE_OUTPUT_ALT4
#define P1_2_AF_CCU40_OUT1  	XMC_GPIO_MODE_OUTPUT_ALT3
#define P1_2_AF_ERU1_PDOUT1 	XMC_GPIO_MODE_OUTPUT_ALT4
#define P1_3_AF_U0C0_MCLKOUT	XMC_GPIO_MODE_OUTPUT_ALT2
#define P1_3_AF_CCU40_OUT0  	XMC_GPIO_MODE_OUTPUT_ALT3
#define P1_3_AF_ERU1_PDOUT0 	XMC_GPIO_MODE_OUTPUT_ALT4
#define P1_4_AF_WDT_REQUEST 	XMC_GPIO_MODE_OUTPUT_ALT1
#define P1_4_AF_CAN_N0_TXD  	XMC_GPIO_MODE_OUTPUT_ALT2
#define P1_4_AF_CCU80_OUT33 	XMC_GPIO_MODE_OUTPUT_ALT3
#define P1_5_AF_U0C0_DOUT0  	XMC_GPIO_MODE_OUTPUT_ALT2
#define P1_5_AF_CCU80_OUT23 	XMC_GPIO_MODE_OUTPUT_ALT3
#define P1_7_AF_U0C0_DOUT0  	XMC_GPIO_MODE_OUTPUT_ALT2
#define P1_7_AF_U1C1_SELO2  	XMC_GPIO_MODE_OUTPUT_ALT4
#define P1_8_AF_U0C0_SELO1  	XMC_GPIO_MODE_OUTPUT_ALT2
#define P1_8_AF_U1C1_SCLKOUT	XMC_GPIO_MODE_OUTPUT_ALT4
#define P1_9_AF_U0C0_SCLKOUT	XMC_GPIO_MODE_OUTPUT_ALT1
#define P1_9_AF_U1C1_DOUT0  	XMC_GPIO_MODE_OUTPUT_ALT4
#define P1_15_AF_SCU_EXTCLK 	XMC_GPIO_MODE_OUTPUT_ALT1
#define P1_15_AF_U1C0_DOUT0 	XMC_GPIO_MODE_OUTPUT_ALT4
#define P2_0_AF_CAN_N0_TXD  	XMC_GPIO_MODE_OUTPUT_ALT1
#define P2_2_AF_VADC_EMUX00 	XMC_GPIO_MODE_OUTPUT_ALT1
#define P2_2_AF_CCU41_OUT3  	XMC_GPIO_MODE_OUTPUT_ALT3
#define P2_3_AF_VADC_EMUX01 	XMC_GPIO_MODE_OUTPUT_ALT1
#define P2_3_AF_U0C1_SELO0  	XMC_GPIO_MODE_OUTPUT_ALT2
#define P2_3_AF_CCU41_OUT2  	XMC_GPIO_MODE_OUTPUT_ALT3
#define P2_4_AF_VADC_EMUX02 	XMC_GPIO_MODE_OUTPUT_ALT1
#define P2_4_AF_U0C1_SCLKOUT	XMC_GPIO_MODE_OUTPUT_ALT2
#define P2_4_AF_CCU41_OUT1  	XMC_GPIO_MODE_OUTPUT_ALT3
#define P2_5_AF_U0C1_DOUT0  	XMC_GPIO_MODE_OUTPUT_ALT2
#define P2_5_AF_CCU41_OUT0  	XMC_GPIO_MODE_OUTPUT_ALT3
#define P2_6_AF_CCU80_OUT13 	XMC_GPIO_MODE_OUTPUT_ALT3
#define P2_7_AF_CCU80_OUT03 	XMC_GPIO_MODE_OUTPUT_ALT3
#define P2_8_AF_CCU80_OUT32 	XMC_GPIO_MODE_OUTPUT_ALT3
#define P2_9_AF_CCU80_OUT22 	XMC_GPIO_MODE_OUTPUT_ALT3
#define P2_14_AF_VADC_EMUX11	XMC_GPIO_MODE_OUTPUT_ALT1
#define P2_14_AF_U1C0_DOUT0 	XMC_GPIO_MODE_OUTPUT_ALT2
#define P2_14_AF_CCU80_OUT21	XMC_GPIO_MODE_OUTPUT_ALT3
#define P2_15_AF_VADC_EMUX22	XMC_GPIO_MODE_OUTPUT_ALT1
#define P2_15_AF_CCU80_OUT11	XMC_GPIO_MODE_OUTPUT_ALT3
#define P3_0_AF_U0C1_SCLKOUT	XMC_GPIO_MODE_OUTPUT_ALT2

/* HW control options */
#define P0_2_HWCTRL_U1C0_DOUT3        	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P0_3_HWCTRL_U1C0_DOUT2        	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P0_4_HWCTRL_U1C0_DOUT1        	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P0_5_HWCTRL_U1C0_DOUT0        	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P1_2_HWCTRL_U0C0_DOUT3        	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P1_3_HWCTRL_U0C0_DOUT2        	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P1_4_HWCTRL_U0C0_DOUT1        	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P1_5_HWCTRL_U0C0_DOUT0        	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P2_1_HWCTRL_DB_TDO_TRACESWO   	XMC_GPIO_HWCTRL_PERIPHERAL1
#endif


#if (UC_DEVICE == XMC4108) && (UC_PACKAGE == VQFN48)
#define P0_0	XMC_GPIO_PORT0, 0
#define P0_1	XMC_GPIO_PORT0, 1
#define P0_2	XMC_GPIO_PORT0, 2
#define P0_3	XMC_GPIO_PORT0, 3
#define P0_4	XMC_GPIO_PORT0, 4
#define P0_5	XMC_GPIO_PORT0, 5
#define P0_6	XMC_GPIO_PORT0, 6
#define P0_7	XMC_GPIO_PORT0, 7
#define P0_8	XMC_GPIO_PORT0, 8
#define P0_9	XMC_GPIO_PORT0, 9
#define P1_0	XMC_GPIO_PORT1, 0
#define P1_1	XMC_GPIO_PORT1, 1
#define P1_2	XMC_GPIO_PORT1, 2
#define P1_3	XMC_GPIO_PORT1, 3
#define P1_4	XMC_GPIO_PORT1, 4
#define P1_5	XMC_GPIO_PORT1, 5
#define P2_0	XMC_GPIO_PORT2, 0
#define P2_1	XMC_GPIO_PORT2, 1
#define P2_2	XMC_GPIO_PORT2, 2
#define P2_3	XMC_GPIO_PORT2, 3
#define P2_4	XMC_GPIO_PORT2, 4
#define P2_5	XMC_GPIO_PORT2, 5
#define P14_0	XMC_GPIO_PORT14, 0
#define P14_3	XMC_GPIO_PORT14, 3
#define P14_4	XMC_GPIO_PORT14, 4
#define P14_5	XMC_GPIO_PORT14, 5
#define P14_6	XMC_GPIO_PORT14, 6
#define P14_7	XMC_GPIO_PORT14, 7
#define P14_8	XMC_GPIO_PORT14, 8
#define P14_9	XMC_GPIO_PORT14, 9


/* Alternate Output Function */
#define P0_0_AF_CAN_N0_TXD  	XMC_GPIO_MODE_OUTPUT_ALT2
#define P0_0_AF_CCU80_OUT21 	XMC_GPIO_MODE_OUTPUT_ALT3
#define P0_1_AF_U1C1_DOUT0  	XMC_GPIO_MODE_OUTPUT_ALT2
#define P0_1_AF_CCU80_OUT11 	XMC_GPIO_MODE_OUTPUT_ALT3
#define P0_2_AF_U1C1_SELO1  	XMC_GPIO_MODE_OUTPUT_ALT2
#define P0_2_AF_CCU80_OUT01 	XMC_GPIO_MODE_OUTPUT_ALT3
#define P0_3_AF_CCU80_OUT20 	XMC_GPIO_MODE_OUTPUT_ALT3
#define P0_4_AF_CCU80_OUT10 	XMC_GPIO_MODE_OUTPUT_ALT3
#define P0_5_AF_U1C0_DOUT0  	XMC_GPIO_MODE_OUTPUT_ALT2
#define P0_5_AF_CCU80_OUT00 	XMC_GPIO_MODE_OUTPUT_ALT3
#define P0_6_AF_U1C0_SELO0  	XMC_GPIO_MODE_OUTPUT_ALT2
#define P0_6_AF_CCU80_OUT30 	XMC_GPIO_MODE_OUTPUT_ALT3
#define P0_7_AF_WDT_REQUEST 	XMC_GPIO_MODE_OUTPUT_ALT1
#define P0_7_AF_U0C0_SELO0  	XMC_GPIO_MODE_OUTPUT_ALT2
#define P0_8_AF_SCU_EXTCLK  	XMC_GPIO_MODE_OUTPUT_ALT1
#define P0_8_AF_U0C0_SCLKOUT	XMC_GPIO_MODE_OUTPUT_ALT2
#define P1_0_AF_U0C0_SELO0  	XMC_GPIO_MODE_OUTPUT_ALT2
#define P1_0_AF_CCU40_OUT3  	XMC_GPIO_MODE_OUTPUT_ALT3
#define P1_0_AF_ERU1_PDOUT3 	XMC_GPIO_MODE_OUTPUT_ALT4
#define P1_1_AF_U0C0_SCLKOUT	XMC_GPIO_MODE_OUTPUT_ALT2
#define P1_1_AF_CCU40_OUT2  	XMC_GPIO_MODE_OUTPUT_ALT3
#define P1_1_AF_ERU1_PDOUT2 	XMC_GPIO_MODE_OUTPUT_ALT4
#define P1_2_AF_CCU40_OUT1  	XMC_GPIO_MODE_OUTPUT_ALT3
#define P1_2_AF_ERU1_PDOUT1 	XMC_GPIO_MODE_OUTPUT_ALT4
#define P1_3_AF_U0C0_MCLKOUT	XMC_GPIO_MODE_OUTPUT_ALT2
#define P1_3_AF_CCU40_OUT0  	XMC_GPIO_MODE_OUTPUT_ALT3
#define P1_3_AF_ERU1_PDOUT0 	XMC_GPIO_MODE_OUTPUT_ALT4
#define P1_4_AF_WDT_REQUEST 	XMC_GPIO_MODE_OUTPUT_ALT1
#define P1_4_AF_CAN_N0_TXD  	XMC_GPIO_MODE_OUTPUT_ALT2
#define P1_4_AF_CCU80_OUT33 	XMC_GPIO_MODE_OUTPUT_ALT3
#define P1_5_AF_U0C0_DOUT0  	XMC_GPIO_MODE_OUTPUT_ALT2
#define P1_5_AF_CCU80_OUT23 	XMC_GPIO_MODE_OUTPUT_ALT3
#define P2_0_AF_CAN_N0_TXD  	XMC_GPIO_MODE_OUTPUT_ALT1
#define P2_2_AF_VADC_EMUX00 	XMC_GPIO_MODE_OUTPUT_ALT1
#define P2_2_AF_CCU41_OUT3  	XMC_GPIO_MODE_OUTPUT_ALT3
#define P2_3_AF_VADC_EMUX01 	XMC_GPIO_MODE_OUTPUT_ALT1
#define P2_3_AF_U0C1_SELO0  	XMC_GPIO_MODE_OUTPUT_ALT2
#define P2_3_AF_CCU41_OUT2  	XMC_GPIO_MODE_OUTPUT_ALT3
#define P2_4_AF_VADC_EMUX02 	XMC_GPIO_MODE_OUTPUT_ALT1
#define P2_4_AF_U0C1_SCLKOUT	XMC_GPIO_MODE_OUTPUT_ALT2
#define P2_4_AF_CCU41_OUT1  	XMC_GPIO_MODE_OUTPUT_ALT3
#define P2_5_AF_U0C1_DOUT0  	XMC_GPIO_MODE_OUTPUT_ALT2
#define P2_5_AF_CCU41_OUT0  	XMC_GPIO_MODE_OUTPUT_ALT3

/* HW control options */
#define P0_2_HWCTRL_U1C0_DOUT3        	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P0_3_HWCTRL_U1C0_DOUT2        	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P0_4_HWCTRL_U1C0_DOUT1        	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P0_5_HWCTRL_U1C0_DOUT0        	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P1_2_HWCTRL_U0C0_DOUT3        	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P1_3_HWCTRL_U0C0_DOUT2        	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P1_4_HWCTRL_U0C0_DOUT1        	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P1_5_HWCTRL_U0C0_DOUT0        	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P2_1_HWCTRL_DB_TDO_TRACESWO   	XMC_GPIO_HWCTRL_PERIPHERAL1
#endif


#if (UC_DEVICE == XMC4200) && (UC_PACKAGE == LQFP64)
#define P0_0	XMC_GPIO_PORT0, 0
#define P0_1	XMC_GPIO_PORT0, 1
#define P0_2	XMC_GPIO_PORT0, 2
#define P0_3	XMC_GPIO_PORT0, 3
#define P0_4	XMC_GPIO_PORT0, 4
#define P0_5	XMC_GPIO_PORT0, 5
#define P0_6	XMC_GPIO_PORT0, 6
#define P0_7	XMC_GPIO_PORT0, 7
#define P0_8	XMC_GPIO_PORT0, 8
#define P0_9	XMC_GPIO_PORT0, 9
#define P0_10	XMC_GPIO_PORT0, 10
#define P0_11	XMC_GPIO_PORT0, 11
#define P1_0	XMC_GPIO_PORT1, 0
#define P1_1	XMC_GPIO_PORT1, 1
#define P1_2	XMC_GPIO_PORT1, 2
#define P1_3	XMC_GPIO_PORT1, 3
#define P1_4	XMC_GPIO_PORT1, 4
#define P1_5	XMC_GPIO_PORT1, 5
#define P1_7	XMC_GPIO_PORT1, 7
#define P1_8	XMC_GPIO_PORT1, 8
#define P1_9	XMC_GPIO_PORT1, 9
#define P1_15	XMC_GPIO_PORT1, 15
#define P2_0	XMC_GPIO_PORT2, 0
#define P2_1	XMC_GPIO_PORT2, 1
#define P2_2	XMC_GPIO_PORT2, 2
#define P2_3	XMC_GPIO_PORT2, 3
#define P2_4	XMC_GPIO_PORT2, 4
#define P2_5	XMC_GPIO_PORT2, 5
#define P2_6	XMC_GPIO_PORT2, 6
#define P2_7	XMC_GPIO_PORT2, 7
#define P2_8	XMC_GPIO_PORT2, 8
#define P2_9	XMC_GPIO_PORT2, 9
#define P2_14	XMC_GPIO_PORT2, 14
#define P2_15	XMC_GPIO_PORT2, 15
#define P3_0	XMC_GPIO_PORT3, 0
#define P14_0	XMC_GPIO_PORT14, 0
#define P14_3	XMC_GPIO_PORT14, 3
#define P14_4	XMC_GPIO_PORT14, 4
#define P14_5	XMC_GPIO_PORT14, 5
#define P14_6	XMC_GPIO_PORT14, 6
#define P14_7	XMC_GPIO_PORT14, 7
#define P14_8	XMC_GPIO_PORT14, 8
#define P14_9	XMC_GPIO_PORT14, 9
#define P14_14	XMC_GPIO_PORT14, 14


/* Alternate Output Function */
#define P0_0_AF_CAN_N0_TXD  	XMC_GPIO_MODE_OUTPUT_ALT2
#define P0_0_AF_CCU80_OUT21 	XMC_GPIO_MODE_OUTPUT_ALT3
#define P0_0_AF_LEDTS0_COL2 	XMC_GPIO_MODE_OUTPUT_ALT4
#define P0_1_AF_USB_DRIVEVBUS	XMC_GPIO_MODE_OUTPUT_ALT1
#define P0_1_AF_U1C1_DOUT0  	XMC_GPIO_MODE_OUTPUT_ALT2
#define P0_1_AF_CCU80_OUT11 	XMC_GPIO_MODE_OUTPUT_ALT3
#define P0_1_AF_LEDTS0_COL3 	XMC_GPIO_MODE_OUTPUT_ALT4
#define P0_2_AF_U1C1_SELO1  	XMC_GPIO_MODE_OUTPUT_ALT2
#define P0_2_AF_CCU80_OUT01 	XMC_GPIO_MODE_OUTPUT_ALT3
#define P0_2_AF_HRPWM0_OUT01	XMC_GPIO_MODE_OUTPUT_ALT4
#define P0_3_AF_CCU80_OUT20 	XMC_GPIO_MODE_OUTPUT_ALT3
#define P0_3_AF_HRPWM0_OUT20	XMC_GPIO_MODE_OUTPUT_ALT4
#define P0_4_AF_CCU80_OUT10 	XMC_GPIO_MODE_OUTPUT_ALT3
#define P0_4_AF_HRPWM0_OUT21	XMC_GPIO_MODE_OUTPUT_ALT4
#define P0_5_AF_U1C0_DOUT0  	XMC_GPIO_MODE_OUTPUT_ALT2
#define P0_5_AF_CCU80_OUT00 	XMC_GPIO_MODE_OUTPUT_ALT3
#define P0_5_AF_HRPWM0_OUT00	XMC_GPIO_MODE_OUTPUT_ALT4
#define P0_6_AF_U1C0_SELO0  	XMC_GPIO_MODE_OUTPUT_ALT2
#define P0_6_AF_CCU80_OUT30 	XMC_GPIO_MODE_OUTPUT_ALT3
#define P0_6_AF_HRPWM0_OUT30	XMC_GPIO_MODE_OUTPUT_ALT4
#define P0_7_AF_WDT_REQUEST 	XMC_GPIO_MODE_OUTPUT_ALT1
#define P0_7_AF_U0C0_SELO0  	XMC_GPIO_MODE_OUTPUT_ALT2
#define P0_7_AF_HRPWM0_OUT11	XMC_GPIO_MODE_OUTPUT_ALT4
#define P0_8_AF_SCU_EXTCLK  	XMC_GPIO_MODE_OUTPUT_ALT1
#define P0_8_AF_U0C0_SCLKOUT	XMC_GPIO_MODE_OUTPUT_ALT2
#define P0_8_AF_HRPWM0_OUT10	XMC_GPIO_MODE_OUTPUT_ALT4
#define P0_9_AF_HRPWM0_OUT31	XMC_GPIO_MODE_OUTPUT_ALT1
#define P0_9_AF_U1C1_SELO0  	XMC_GPIO_MODE_OUTPUT_ALT2
#define P0_9_AF_CCU80_OUT12 	XMC_GPIO_MODE_OUTPUT_ALT3
#define P0_9_AF_LEDTS0_COL0 	XMC_GPIO_MODE_OUTPUT_ALT4
#define P0_10_AF_U1C1_SCLKOUT	XMC_GPIO_MODE_OUTPUT_ALT2
#define P0_10_AF_CCU80_OUT02	XMC_GPIO_MODE_OUTPUT_ALT3
#define P0_10_AF_LEDTS0_COL1	XMC_GPIO_MODE_OUTPUT_ALT4
#define P0_11_AF_U1C0_SCLKOUT	XMC_GPIO_MODE_OUTPUT_ALT2
#define P0_11_AF_CCU80_OUT31	XMC_GPIO_MODE_OUTPUT_ALT3
#define P1_0_AF_U0C0_SELO0  	XMC_GPIO_MODE_OUTPUT_ALT2
#define P1_0_AF_CCU40_OUT3  	XMC_GPIO_MODE_OUTPUT_ALT3
#define P1_0_AF_ERU1_PDOUT3 	XMC_GPIO_MODE_OUTPUT_ALT4
#define P1_1_AF_U0C0_SCLKOUT	XMC_GPIO_MODE_OUTPUT_ALT2
#define P1_1_AF_CCU40_OUT2  	XMC_GPIO_MODE_OUTPUT_ALT3
#define P1_1_AF_ERU1_PDOUT2 	XMC_GPIO_MODE_OUTPUT_ALT4
#define P1_2_AF_CCU40_OUT1  	XMC_GPIO_MODE_OUTPUT_ALT3
#define P1_2_AF_ERU1_PDOUT1 	XMC_GPIO_MODE_OUTPUT_ALT4
#define P1_3_AF_U0C0_MCLKOUT	XMC_GPIO_MODE_OUTPUT_ALT2
#define P1_3_AF_CCU40_OUT0  	XMC_GPIO_MODE_OUTPUT_ALT3
#define P1_3_AF_ERU1_PDOUT0 	XMC_GPIO_MODE_OUTPUT_ALT4
#define P1_4_AF_WDT_REQUEST 	XMC_GPIO_MODE_OUTPUT_ALT1
#define P1_4_AF_CAN_N0_TXD  	XMC_GPIO_MODE_OUTPUT_ALT2
#define P1_4_AF_CCU80_OUT33 	XMC_GPIO_MODE_OUTPUT_ALT3
#define P1_5_AF_CAN_N1_TXD  	XMC_GPIO_MODE_OUTPUT_ALT1
#define P1_5_AF_U0C0_DOUT0  	XMC_GPIO_MODE_OUTPUT_ALT2
#define P1_5_AF_CCU80_OUT23 	XMC_GPIO_MODE_OUTPUT_ALT3
#define P1_7_AF_U0C0_DOUT0  	XMC_GPIO_MODE_OUTPUT_ALT2
#define P1_7_AF_U1C1_SELO2  	XMC_GPIO_MODE_OUTPUT_ALT4
#define P1_8_AF_U0C0_SELO1  	XMC_GPIO_MODE_OUTPUT_ALT2
#define P1_8_AF_U1C1_SCLKOUT	XMC_GPIO_MODE_OUTPUT_ALT4
#define P1_9_AF_U0C0_SCLKOUT	XMC_GPIO_MODE_OUTPUT_ALT1
#define P1_9_AF_U1C1_DOUT0  	XMC_GPIO_MODE_OUTPUT_ALT4
#define P1_15_AF_SCU_EXTCLK 	XMC_GPIO_MODE_OUTPUT_ALT1
#define P1_15_AF_U1C0_DOUT0 	XMC_GPIO_MODE_OUTPUT_ALT4
#define P2_0_AF_CAN_N0_TXD  	XMC_GPIO_MODE_OUTPUT_ALT1
#define P2_0_AF_LEDTS0_COL1 	XMC_GPIO_MODE_OUTPUT_ALT4
#define P2_1_AF_LEDTS0_COL0 	XMC_GPIO_MODE_OUTPUT_ALT4
#define P2_2_AF_VADC_EMUX00 	XMC_GPIO_MODE_OUTPUT_ALT1
#define P2_2_AF_CCU41_OUT3  	XMC_GPIO_MODE_OUTPUT_ALT3
#define P2_2_AF_LEDTS0_LINE0	XMC_GPIO_MODE_OUTPUT_ALT4
#define P2_3_AF_VADC_EMUX01 	XMC_GPIO_MODE_OUTPUT_ALT1
#define P2_3_AF_U0C1_SELO0  	XMC_GPIO_MODE_OUTPUT_ALT2
#define P2_3_AF_CCU41_OUT2  	XMC_GPIO_MODE_OUTPUT_ALT3
#define P2_3_AF_LEDTS0_LINE1	XMC_GPIO_MODE_OUTPUT_ALT4
#define P2_4_AF_VADC_EMUX02 	XMC_GPIO_MODE_OUTPUT_ALT1
#define P2_4_AF_U0C1_SCLKOUT	XMC_GPIO_MODE_OUTPUT_ALT2
#define P2_4_AF_CCU41_OUT1  	XMC_GPIO_MODE_OUTPUT_ALT3
#define P2_4_AF_LEDTS0_LINE2	XMC_GPIO_MODE_OUTPUT_ALT4
#define P2_5_AF_U0C1_DOUT0  	XMC_GPIO_MODE_OUTPUT_ALT2
#define P2_5_AF_CCU41_OUT0  	XMC_GPIO_MODE_OUTPUT_ALT3
#define P2_5_AF_LEDTS0_LINE3	XMC_GPIO_MODE_OUTPUT_ALT4
#define P2_6_AF_CCU80_OUT13 	XMC_GPIO_MODE_OUTPUT_ALT3
#define P2_6_AF_LEDTS0_COL3 	XMC_GPIO_MODE_OUTPUT_ALT4
#define P2_7_AF_CAN_N1_TXD  	XMC_GPIO_MODE_OUTPUT_ALT2
#define P2_7_AF_CCU80_OUT03 	XMC_GPIO_MODE_OUTPUT_ALT3
#define P2_7_AF_LEDTS0_COL2 	XMC_GPIO_MODE_OUTPUT_ALT4
#define P2_8_AF_CCU80_OUT32 	XMC_GPIO_MODE_OUTPUT_ALT3
#define P2_8_AF_LEDTS0_LINE4	XMC_GPIO_MODE_OUTPUT_ALT4
#define P2_9_AF_CCU80_OUT22 	XMC_GPIO_MODE_OUTPUT_ALT3
#define P2_9_AF_LEDTS0_LINE5	XMC_GPIO_MODE_OUTPUT_ALT4
#define P2_14_AF_VADC_EMUX11	XMC_GPIO_MODE_OUTPUT_ALT1
#define P2_14_AF_U1C0_DOUT0 	XMC_GPIO_MODE_OUTPUT_ALT2
#define P2_14_AF_CCU80_OUT21	XMC_GPIO_MODE_OUTPUT_ALT3
#define P2_15_AF_VADC_EMUX22	XMC_GPIO_MODE_OUTPUT_ALT1
#define P2_15_AF_CCU80_OUT11	XMC_GPIO_MODE_OUTPUT_ALT3
#define P2_15_AF_LEDTS0_LINE6	XMC_GPIO_MODE_OUTPUT_ALT4
#define P3_0_AF_U0C1_SCLKOUT	XMC_GPIO_MODE_OUTPUT_ALT2

/* HW control options */
#define P0_2_HWCTRL_U1C0_DOUT3        	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P0_3_HWCTRL_U1C0_DOUT2        	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P0_4_HWCTRL_U1C0_DOUT1        	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P0_5_HWCTRL_U1C0_DOUT0        	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P1_2_HWCTRL_U0C0_DOUT3        	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P1_3_HWCTRL_U0C0_DOUT2        	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P1_4_HWCTRL_U0C0_DOUT1        	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P1_5_HWCTRL_U0C0_DOUT0        	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P2_1_HWCTRL_DB_TDO_TRACESWO   	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P2_2_HWCTRL_LEDTS0_TSIN0      	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P2_3_HWCTRL_LEDTS0_TSIN1      	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P2_4_HWCTRL_LEDTS0_TSIN2      	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P2_5_HWCTRL_LEDTS0_TSIN3      	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P2_8_HWCTRL_LEDTS0_TSIN4      	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P2_9_HWCTRL_LEDTS0_TSIN5      	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P2_15_HWCTRL_LEDTS0_TSIN6     	XMC_GPIO_HWCTRL_PERIPHERAL1
#endif


#if (UC_DEVICE == XMC4200) && (UC_PACKAGE == VQFN48)
#define P0_0	XMC_GPIO_PORT0, 0
#define P0_1	XMC_GPIO_PORT0, 1
#define P0_2	XMC_GPIO_PORT0, 2
#define P0_3	XMC_GPIO_PORT0, 3
#define P0_4	XMC_GPIO_PORT0, 4
#define P0_5	XMC_GPIO_PORT0, 5
#define P0_6	XMC_GPIO_PORT0, 6
#define P0_7	XMC_GPIO_PORT0, 7
#define P0_8	XMC_GPIO_PORT0, 8
#define P0_9	XMC_GPIO_PORT0, 9
#define P1_0	XMC_GPIO_PORT1, 0
#define P1_1	XMC_GPIO_PORT1, 1
#define P1_2	XMC_GPIO_PORT1, 2
#define P1_3	XMC_GPIO_PORT1, 3
#define P1_4	XMC_GPIO_PORT1, 4
#define P1_5	XMC_GPIO_PORT1, 5
#define P2_0	XMC_GPIO_PORT2, 0
#define P2_1	XMC_GPIO_PORT2, 1
#define P2_2	XMC_GPIO_PORT2, 2
#define P2_3	XMC_GPIO_PORT2, 3
#define P2_4	XMC_GPIO_PORT2, 4
#define P2_5	XMC_GPIO_PORT2, 5
#define P14_0	XMC_GPIO_PORT14, 0
#define P14_3	XMC_GPIO_PORT14, 3
#define P14_4	XMC_GPIO_PORT14, 4
#define P14_5	XMC_GPIO_PORT14, 5
#define P14_6	XMC_GPIO_PORT14, 6
#define P14_7	XMC_GPIO_PORT14, 7
#define P14_8	XMC_GPIO_PORT14, 8
#define P14_9	XMC_GPIO_PORT14, 9


