ARMmbed/mbed-os/targets/TARGET_Infineon/XMCLib/inc/xmc4_gpio_map.h
/* HW control options */
#define P0_2_HWCTRL_U1C0_DOUT3        	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P0_2_HWCTRL_EBU_AD0           	XMC_GPIO_HWCTRL_PERIPHERAL2
#define P0_3_HWCTRL_U1C0_DOUT2        	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P0_3_HWCTRL_EBU_AD1           	XMC_GPIO_HWCTRL_PERIPHERAL2
#define P0_4_HWCTRL_U1C0_DOUT1        	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P0_4_HWCTRL_EBU_AD2           	XMC_GPIO_HWCTRL_PERIPHERAL2
#define P0_5_HWCTRL_U1C0_DOUT0        	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P0_5_HWCTRL_EBU_AD3           	XMC_GPIO_HWCTRL_PERIPHERAL2
#define P0_6_HWCTRL_EBU_ADV           	XMC_GPIO_HWCTRL_PERIPHERAL2
#define P0_7_HWCTRL_EBU_AD6           	XMC_GPIO_HWCTRL_PERIPHERAL2
#define P0_8_HWCTRL_EBU_AD7           	XMC_GPIO_HWCTRL_PERIPHERAL2
#define P0_9_HWCTRL_ETH0_MDO          	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P0_9_HWCTRL_EBU_CS1           	XMC_GPIO_HWCTRL_PERIPHERAL2
#define P0_11_HWCTRL_SDMMC_RESET      	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P0_11_HWCTRL_EBU_BREQ         	XMC_GPIO_HWCTRL_PERIPHERAL2
#define P0_12_HWCTRL_EBU_HLDA_OUT     	XMC_GPIO_HWCTRL_PERIPHERAL2
#define P0_14_HWCTRL_U1C1_DOUT3       	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P0_15_HWCTRL_U1C1_DOUT2       	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P1_2_HWCTRL_U0C0_DOUT3        	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P1_2_HWCTRL_EBU_AD14          	XMC_GPIO_HWCTRL_PERIPHERAL2
#define P1_3_HWCTRL_U0C0_DOUT2        	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P1_3_HWCTRL_EBU_AD15          	XMC_GPIO_HWCTRL_PERIPHERAL2
#define P1_4_HWCTRL_U0C0_DOUT1        	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P1_5_HWCTRL_U0C0_DOUT0        	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P1_6_HWCTRL_SDMMC_DATA_OUT1   	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P1_6_HWCTRL_EBU_AD10          	XMC_GPIO_HWCTRL_PERIPHERAL2
#define P1_7_HWCTRL_SDMMC_DATA_OUT2   	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P1_7_HWCTRL_EBU_AD11          	XMC_GPIO_HWCTRL_PERIPHERAL2
#define P1_8_HWCTRL_SDMMC_DATA_OUT4   	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P1_8_HWCTRL_EBU_AD12          	XMC_GPIO_HWCTRL_PERIPHERAL2
#define P1_9_HWCTRL_SDMMC_DATA_OUT5   	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P1_9_HWCTRL_EBU_AD13          	XMC_GPIO_HWCTRL_PERIPHERAL2
#define P1_11_HWCTRL_ETH0_MDO         	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P1_12_HWCTRL_SDMMC_DATA_OUT6  	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P1_12_HWCTRL_EBU_AD16         	XMC_GPIO_HWCTRL_PERIPHERAL2
#define P1_13_HWCTRL_SDMMC_DATA_OUT7  	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P1_13_HWCTRL_EBU_AD17         	XMC_GPIO_HWCTRL_PERIPHERAL2
#define P1_14_HWCTRL_EBU_AD18         	XMC_GPIO_HWCTRL_PERIPHERAL2
#define P1_15_HWCTRL_EBU_AD19         	XMC_GPIO_HWCTRL_PERIPHERAL2
#define P2_0_HWCTRL_ETH0_MDO          	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P2_0_HWCTRL_EBU_AD20          	XMC_GPIO_HWCTRL_PERIPHERAL2
#define P2_1_HWCTRL_DB_TDO_TRACESWO   	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P2_1_HWCTRL_EBU_AD21          	XMC_GPIO_HWCTRL_PERIPHERAL2
#define P2_2_HWCTRL_LEDTS0_TSIN0      	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P2_2_HWCTRL_EBU_AD22          	XMC_GPIO_HWCTRL_PERIPHERAL2
#define P2_3_HWCTRL_LEDTS0_TSIN1      	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P2_3_HWCTRL_EBU_AD23          	XMC_GPIO_HWCTRL_PERIPHERAL2
#define P2_4_HWCTRL_LEDTS0_TSIN2      	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P2_4_HWCTRL_EBU_AD24          	XMC_GPIO_HWCTRL_PERIPHERAL2
#define P2_5_HWCTRL_LEDTS0_TSIN3      	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P2_5_HWCTRL_EBU_AD25          	XMC_GPIO_HWCTRL_PERIPHERAL2
#define P2_6_HWCTRL_U2C0_DOUT3        	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P2_8_HWCTRL_LEDTS0_TSIN4      	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P2_8_HWCTRL_EBU_AD26          	XMC_GPIO_HWCTRL_PERIPHERAL2
#define P2_9_HWCTRL_LEDTS0_TSIN5      	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P2_9_HWCTRL_EBU_AD27          	XMC_GPIO_HWCTRL_PERIPHERAL2
#define P2_10_HWCTRL_DB_ETM_TRACEDATA3	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P2_10_HWCTRL_EBU_AD28         	XMC_GPIO_HWCTRL_PERIPHERAL2
#define P2_11_HWCTRL_DB_ETM_TRACEDATA2	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P2_11_HWCTRL_EBU_AD29         	XMC_GPIO_HWCTRL_PERIPHERAL2
#define P2_12_HWCTRL_DB_ETM_TRACEDATA1	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P2_12_HWCTRL_EBU_AD30         	XMC_GPIO_HWCTRL_PERIPHERAL2
#define P2_13_HWCTRL_DB_ETM_TRACEDATA0	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P2_13_HWCTRL_EBU_AD31         	XMC_GPIO_HWCTRL_PERIPHERAL2
#define P2_14_HWCTRL_DB_ETM_TRACECLK  	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P2_14_HWCTRL_EBU_BC0          	XMC_GPIO_HWCTRL_PERIPHERAL2
#define P2_15_HWCTRL_LEDTS0_TSIN6     	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P2_15_HWCTRL_EBU_BC1          	XMC_GPIO_HWCTRL_PERIPHERAL2
#define P3_0_HWCTRL_EBU_RD            	XMC_GPIO_HWCTRL_PERIPHERAL2
#define P3_1_HWCTRL_EBU_RD_NWR        	XMC_GPIO_HWCTRL_PERIPHERAL2
#define P3_2_HWCTRL_EBU_CS0           	XMC_GPIO_HWCTRL_PERIPHERAL2
#define P3_3_HWCTRL_SDMMC_LED         	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P3_4_HWCTRL_SDMMC_BUS_POWER   	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P3_5_HWCTRL_SDMMC_CMD_OUT     	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P3_5_HWCTRL_EBU_AD4           	XMC_GPIO_HWCTRL_PERIPHERAL2
#define P3_6_HWCTRL_SDMMC_CLK_OUT     	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P3_6_HWCTRL_EBU_AD5           	XMC_GPIO_HWCTRL_PERIPHERAL2
#define P3_10_HWCTRL_U0C1_DOUT3       	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P3_11_HWCTRL_U0C1_DOUT2       	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P3_12_HWCTRL_U0C1_DOUT1       	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P3_13_HWCTRL_U0C1_DOUT0       	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P3_14_HWCTRL_U1C1_DOUT1       	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P3_15_HWCTRL_U1C1_DOUT0       	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P4_0_HWCTRL_SDMMC_DATA_OUT0   	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P4_0_HWCTRL_EBU_AD8           	XMC_GPIO_HWCTRL_PERIPHERAL2
#define P4_1_HWCTRL_SDMMC_DATA_OUT3   	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P4_1_HWCTRL_EBU_AD9           	XMC_GPIO_HWCTRL_PERIPHERAL2
#define P4_4_HWCTRL_U2C1_DOUT3        	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P4_5_HWCTRL_U2C1_DOUT2        	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P4_6_HWCTRL_U2C1_DOUT1        	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P4_7_HWCTRL_U2C1_DOUT0        	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P5_0_HWCTRL_U2C0_DOUT0        	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P5_1_HWCTRL_U2C0_DOUT1        	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P5_3_HWCTRL_EBU_CKE           	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P5_3_HWCTRL_EBU_A20           	XMC_GPIO_HWCTRL_PERIPHERAL2
#define P5_4_HWCTRL_EBU_RAS           	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P5_4_HWCTRL_EBU_A21           	XMC_GPIO_HWCTRL_PERIPHERAL2
#define P5_5_HWCTRL_EBU_CAS           	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P5_5_HWCTRL_EBU_A22           	XMC_GPIO_HWCTRL_PERIPHERAL2
#define P5_6_HWCTRL_EBU_BFCLKO        	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P5_6_HWCTRL_EBU_A23           	XMC_GPIO_HWCTRL_PERIPHERAL2
#define P5_7_HWCTRL_U2C0_DOUT2        	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P5_8_HWCTRL_EBU_SDCLKO        	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P5_8_HWCTRL_EBU_CS2           	XMC_GPIO_HWCTRL_PERIPHERAL2
#define P5_9_HWCTRL_EBU_BFCLKO        	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P5_9_HWCTRL_EBU_CS3           	XMC_GPIO_HWCTRL_PERIPHERAL2
#define P5_10_HWCTRL_LEDTS0_TSIN7     	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P6_0_HWCTRL_DB_ETM_TRACECLK   	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P6_0_HWCTRL_EBU_A16           	XMC_GPIO_HWCTRL_PERIPHERAL2
#define P6_1_HWCTRL_DB_ETM_TRACEDATA3 	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P6_1_HWCTRL_EBU_A17           	XMC_GPIO_HWCTRL_PERIPHERAL2
#define P6_2_HWCTRL_DB_ETM_TRACEDATA2 	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P6_2_HWCTRL_EBU_A18           	XMC_GPIO_HWCTRL_PERIPHERAL2
#define P6_4_HWCTRL_EBU_SDCLKO        	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P6_4_HWCTRL_EBU_A19           	XMC_GPIO_HWCTRL_PERIPHERAL2
#define P6_5_HWCTRL_DB_ETM_TRACEDATA1 	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P6_5_HWCTRL_EBU_BC2           	XMC_GPIO_HWCTRL_PERIPHERAL2
#define P6_6_HWCTRL_DB_ETM_TRACEDATA0 	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P6_6_HWCTRL_EBU_BC3           	XMC_GPIO_HWCTRL_PERIPHERAL2
#endif


